In [1]:
import pandas as pd
import numpy as np
import FinanceDataReader  as fdr

In [2]:
# https://financedata.github.io/posts/finance-data-reader-users-guide.html

### 종목데이터 읽어오기

In [3]:
df = fdr.DataReader("148070")  # 114260

In [4]:
df.tail()

              Open    High     Low   Close  Volume    Change
Date
2019-01-15  121240  121330  121150  121330    2999  0.001651
2019-01-16  121420  121460  121195  121265    4786 -0.000536
2019-01-17  121275  121305  121180  121285    1385  0.000165
2019-01-18  121110  121110  120980  120980    3173 -0.002515
2019-01-21  120860  120945  120800  120855    3899 -0.001033

In [5]:
df.head()

             Open   High    Low  Close  Volume    Change
Date
2011-10-20  87372  87486  87347  87439   43093       NaN
2011-10-21  87299  87356  86905  87051    4286 -0.004437
2011-10-24  87075  87075  86717  86750    4303 -0.003458
2011-10-25  86878  87001  86831  86921    1186  0.001971
2011-10-26  86862  87062  86774  87047   17543  0.001450

### csv 파일로 저장하기

In [6]:
df.to_csv("KOSEF국고채10년_daily_data.csv",sep=",",encoding="utf-8")

### 마지막 영업일로 월별데이타 만들기

In [7]:
bm = df.resample("BM").last()

In [8]:
bm.tail()

              Open    High     Low   Close  Volume    Change
Date
2018-09-28  116833  117132  116730  117005     851  0.001386
2018-10-31  118592  118592  118180  118215    4156 -0.003431
2018-11-30  119738  120032  119660  119837    2036  0.001479
2018-12-31  121435  121455  121325  121370    4390 -0.000124
2019-01-31  120860  120945  120800  120855    3899 -0.001033

In [9]:
bm.to_csv("KOSEF국고채10년_monthly_data.csv", sep=",",encoding="utf-8")